---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairIncompleteFailure
source: html/4a1079be-2b22-d4be-556d-6e54786f1bbf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairIncompleteFailure Property

Stair element is incomplete, not all components are logic connected.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairIncompleteFailure { get; }
```